Autodesk.Revit.DB.Electrical.ElectricalSystem.DisconnectPanel
Disconnect the panel for the Electrical System.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the panel parameter Value is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the panel cannot be disconnected for the electrical system.
Remarks: If successful, the system will disconnect this panel. Otherwise the exception will be thrown.
This method will only function with the Autodesk Revit MEP application.

Autodesk.Revit.DB.Electrical.ElectricalSystem.SelectPanel(Autodesk.Revit.DB.FamilyInstance)
Set the panel for the Electrical System.
panel: The panel of the electrical system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the panel parameter Value is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the panel cannot be set for the electrical system.
Remarks: If successful, the panel will be set for the system. Otherwise the exception will be thrown.
This method will only function with the Autodesk Revit MEP application.

Autodesk.Revit.DB.Electrical.ElectricalSystem.GroundConductorsNumber
Returns the GroundConductors Number of the Electrical System.
Remarks: This property is used to retrieve the GroundConductors Number of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.NeutralConductorsNumber
Returns the NeutralConductors Number of the Electrical System.
Remarks: This property is used to retrieve the NeutralConductors Number of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.HotConductorsNumber
Returns the HotConductors Number of the Electrical System.
Remarks: This property is used to retrieve the HotConductors Number of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.RunsNumber
Returns the Runs Number of the Electrical System.
Remarks: This property is used to retrieve the Runs Number of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.WireSizeString
Returns the WireSize as a String of the Electrical System.
Remarks: This property is used to retrieve the WireSize String of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.WireType
Get/Set the wire type of the Electrical System.
Remarks: This property is used to retrieve the wire type of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.BalancedLoad
Reports whether the BalancedLoad is on or off.
Remarks: This property is used to retrieve the BalancedLoad value of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.PowerFactorState
Returns the PowerFactorState type of the Electrical System.
Remarks: This property is used to retrieve the PowerFactorState type of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.PowerFactor
Returns the PowerFactor value of the Electrical System.
Remarks: This property is used to retrieve the PowerFactor value of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.VoltageDrop
Returns the VoltageDrop value of the Electrical System.
Remarks: This property is used to retrieve the VoltageDrop value of the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when the voltage drop cannot be computed,
because it is zero, or because the circuit is not connected to a panel.

Autodesk.Revit.DB.Electrical.ElectricalSystem.TrueCurrentPhaseC
Returns the TrueCurrentPhaseC value of the Electrical System.
Remarks: This property is used to retrieve the TrueCurrentPhaseC value of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.TrueCurrentPhaseB
Returns the TrueCurrentPhaseB value of the Electrical System.
Remarks: This property is used to retrieve the TrueCurrentPhaseB value of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.TrueCurrentPhaseA
Returns the TrueCurrentPhaseA value of the Electrical System.
Remarks: This property is used to retrieve the TrueCurrentPhaseA value of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.TrueCurrent
Returns the TrueCurrent value of the Electrical System.
Remarks: This property is used to retrieve the TrueCurrent value of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.TrueLoadPhaseC
Returns the TrueLoadPhaseC value of the Electrical System.
Remarks: This property is used to retrieve the TrueLoadPhaseC value of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.TrueLoadPhaseB
Returns the TrueLoadPhaseB value of the Electrical System.
Remarks: This property is used to retrieve the TrueLoadPhaseB value of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.TrueLoadPhaseA
Returns the TrueLoadPhaseA value of the Electrical System.
Remarks: This property is used to retrieve the TrueLoadPhaseA value of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.TrueLoad
Returns the TrueLoad value of the Electrical System.
Remarks: This property is used to retrieve the TrueLoad value of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentCurrentPhaseC
Returns the ApparentCurrentPhaseC value of the Electrical System.
Remarks: This property is used to retrieve the ApparentCurrentPhaseC value of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentCurrentPhaseB
Returns the ApparentCurrentPhaseB value of the Electrical System.
Remarks: This property is used to retrieve the ApparentCurrentPhaseB value of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentCurrentPhaseA
Returns the ApparentCurrentPhaseA value of the Electrical System.
Remarks: This property is used to retrieve the ApparentCurrentPhaseA value of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentCurrent
Returns the ApparentCurrent value of the Electrical System.
Remarks: This property is used to retrieve the ApparentCurrent value of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentLoadPhaseC
Returns the ApparentLoadPhaseC value of the Electrical System.
Remarks: This property is used to retrieve the ApparentLoadPhaseC value of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentLoadPhaseB
Returns the ApparentLoadPhaseB value of the Electrical System.
Remarks: This property is used to retrieve the ApparentLoadPhaseB value of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentLoadPhaseA
Returns the ApparentLoadPhaseA value of the Electrical System.
Remarks: This property is used to retrieve the ApparentLoadPhaseA value of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentLoad
Returns the ApparentLoad value of the Electrical System.
Remarks: This property is used to retrieve the ApparentLoad value of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.Voltage
Returns the Voltage value of the Electrical System.
Remarks: This property is used to retrieve the Voltage value of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.Rating
Get/Set the Rating value of the Electrical System.
Remarks: This property is used to retrieve the Rating value of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.StartSlot
Get/Set the Start Slot where the Electrical System is located in its panel.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when no panel has assigned for the electrical system.
Remarks: This property is used to retrieve the Start Slot of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.PolesNumber
Returns the Poles Number of the Electrical System.
Remarks: This property is used to retrieve the Poles Number of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.LoadClassifications
Returns the LoadClassifications used in the Electrical System.
Remarks: This property is used to retrieve the LoadClassifications of the Electrical System.
There may be one or more load classification in use in which case they will be semi-colon
delimited.

Autodesk.Revit.DB.Electrical.ElectricalSystem.Length
Returns the Length value of the Electrical System.
Remarks: This property is used to retrieve the Length value of the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when the length cannot be computed,
because it is zero, or because the circuit is not connected to a panel.

Autodesk.Revit.DB.Electrical.ElectricalSystem.SystemType
Returns the Electrical System Type of the Electrical System.
Remarks: This property is used to retrieve the Electrical System Type of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.PanelName
Returns the Panel name of the Electrical System.
Remarks: This property is used to retrieve the Panel name of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.LoadName
Get/Set the LoadName of the Electrical System.
Remarks: This property is used to retrieve the LoadName of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.CircuitType
Get the circuit type of the Electrical System.
Remarks: This read-only property is used to retrieve the circuit type of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.CircuitNumber
Returns the CircuitNumber of the Electrical System.
Remarks: This property is used to retrieve the CircuitNumber of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem.Name
Returns the Name of the Electrical System.
Remarks: This property is used to get or set the Name of the Electrical System.

Autodesk.Revit.DB.Electrical.ElectricalSystem
Provides access to the Electrical System in Autodesk Revit MEP.
Remarks: The Electrical System object can only be queried in Autodesk Revit MEP.